<template>
	<section>
		<p class="title">Новости производителей</p>
		<div>
			<News v-for="(article,id) in articles" :key="id" :news="article" />
		</div>
	</section>
</template>

<script>
import News from "./News";
export default {
	components: {
		News,
	},
	data() {
		return {
			articles: [
				{
					date: "22.06.17",
					title: "Новый разборный ротационный пекарский шкаф РПШ-18-8-6МР",
					img: "1.png",
					description:
						"Новый разборный ротационный пекарский шкаф РПШ-18-8-6МР: в комплекте тележка-шпилька ТШГ-18 на 18 уровней 600х800 мм вместимость тележки-шпильки - 135 хлебных форм №7 инжекционный тип парообразования разборная конструкция увеличенное стекло двери. Память на 110 программ (до 4-ех этапов в каждой программе) USB-порт. Таймер до 10 ч Регулировка влажности от 0 до 100%. 5 скоро",
				},
				{
					date: "22.06.17",
					title:
						"Повышение энергоэффективности туннельных посудомоечных машин МПТ торговой марки Abat",
					img: "2.png",
					description:
						"С целью снижения нагрузки на электрическую сеть и для повышения энергоэффективности изделий с 1 июня 2017 года был изменен алгоритм работы туннельных посудомоечных машин МПТ торговой марки Abat всех моделей... контроллеры 38ПКА-01 всех туннельных посудомоечных машин МПТ теперь прошиваются новым программным обеспечением.",
				},
				{
					date: "22.06.17",
					title:
						"Повышение энергоэффективности туннельных посудомоечных машин МПТ торговой марки Abat",
					img: "3.png",
					description:
						"С целью снижения нагрузки на электрическую сеть и для повышения энергоэффективности изделий с 1 июня 2017 года был изменен алгоритм работы туннельных посудомоечных машин МПТ торговой марки Abat всех моделей... контроллеры 38ПКА-01 всех туннельных посудомоечных машин МПТ теперь прошиваются новым программным обеспечением.",
				},
				{
					date: "22.06.17",
					title:
						"Повышение энергоэффективности туннельных посудомоечных машин МПТ торговой марки Abat",
					img: "4.png",
					description:
						"С целью снижения нагрузки на электрическую сеть и для повышения энергоэффективности изделий с 1 июня 2017 года был изменен алгоритм работы туннельных посудомоечных машин МПТ торговой марки Abat всех моделей... контроллеры 38ПКА-01 всех туннельных посудомоечных машин МПТ теперь прошиваются новым программным обеспечением.",
				},
			],
		};
	},
};
</script>

<style lang="scss" scoped>
</style>